_posts/language/2021-12-18-english-paranoid.html
---
layout: post
title: 单词本：paranoid
categories: [language]
tags: [English]
---

<p>
前几天读硬件安全模块文档（英文的）的时候，看到这句话：Depending on how
the secure hash is used, either can be correct; but because
cryptographers tend to be P3 people (Paid Professional Paranoids), the
latter is generally used for the strength of a well-designed secure
hash algorithm.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
这里说密码学家通常都是P3人员，即：有偿职业偏执狂。挺有趣的称谓呀。
</p>

<p>
对我来说，这里有一个生词：paranoid [ˈpærənɔɪd] 多疑的，妄想的；患偏执症的，患妄想症的；偏执狂，妄想症患者。
</p>

<p>
似乎 <code>-oid</code> 结尾的词，大多是细菌、生物、疾病相关，如：
</p>
<ul class="org-ul">
<li>schizoid 精神分裂的</li>
<li>phylloid 叶状茎</li>
<li>virusoid 拟病毒；核壳内尖病毒</li>
</ul>

<p>
也有数理化术语，如 centroid 质心。
</p>

<p>
与 paranoid 相关的单词有两个，一个是 paranoia 即妄想症、偏执症，焦虑、恐惧导致的迫害妄想（persecutory belief）。另一个是 paranoiac 与
paranoid 意思相同，不过我感觉前者更偏名词，后者更偏形容词。
</p>

<p>
例句：
</p>
<ul class="org-ul">
<li>the violent defensiveness of the paranoiac is directed against all
who challenge his power. 偏执狂对质疑他权力的人都抱有暴力防卫心理。</li>
<li>Paranoia is an instinct or thought process that is believed to be heavily influenced by anxiety or fear, often to the point of delusion and irrationality.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A Pratical Guide to TPM 2.0
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Paranoia">https://en.wikipedia.org/wiki/Paranoia</a>
</p></div></div>


</div>
</div>
